# Intro do DataFrames

Data Structure in Pandas is named = Data Frames 

DataFrame is esencially a 2D data structure that contains rows and colums

Consist of 
Data = populated in the cells of the data frame
Index = To identify each of the rows.
Colums = To identify columns headers


- Characteristics:
     - Columns can be of differente data types
     - Labelled axes ( colums and rows ) (Cols are names labelled axis and Rows are names number axis)
     - Can add columns to dataframes
     - Can Perform arithmetic operations on rows and columns

- DataFrames can contain the following types of data.
     - Lists
     - Dictionaries
     - Series
     - Numpy arrays
     - Another Data frame

# Work with Pandas

In [5]:
import pandas as pd

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [6]:
#Creating a empty data frame to see its structure

empty_dataframe = pd.DataFrame()
print (empty_dataframe)

Empty DataFrame
Columns: []
Index: []

In [7]:
#Creating a data frame from a list. 

Political_figures = ['Mustafa Kemal Ataturk',
                    'Franklin D. Roosevelt',
                    'Winston Churchill',
                    'Charles de Gaulle',
                    'Jawaharlal Nehru',
                    'Nelson Mandela'
                    'Deng Xiaoping']

df_from_list = pd.DataFrame(Political_figures)
df_from_list

                             0
0        Mustafa Kemal Ataturk
1        Franklin D. Roosevelt
2            Winston Churchill
3            Charles de Gaulle
4             Jawaharlal Nehru
5  Nelson MandelaDeng Xiaoping

In [8]:
#Creating a data frame from tuples

countries = ['Turkey',
            'USA',
            'UK',
            'France',
            'India',
            'South Africa',
            'China']

In [9]:
politicians_tuples = list(zip (Political_figures,countries))

politicians_tuples

[('Mustafa Kemal Ataturk', 'Turkey'),
 ('Franklin D. Roosevelt', 'USA'),
 ('Winston Churchill', 'UK'),
 ('Charles de Gaulle', 'France'),
 ('Jawaharlal Nehru', 'India'),
 ('Nelson MandelaDeng Xiaoping', 'South Africa')]

In [10]:
#Changing to datafram again
#By default the index are numeric and starting from 0

df_from_list_of_tuple = pd.DataFrame(politicians_tuples)
df_from_list_of_tuple

                             0             1
0        Mustafa Kemal Ataturk        Turkey
1        Franklin D. Roosevelt           USA
2            Winston Churchill            UK
3            Charles de Gaulle        France
4             Jawaharlal Nehru         India
5  Nelson MandelaDeng Xiaoping  South Africa

In [16]:
#now let's add column names

df_from_list_of_tuple = pd.DataFrame(politicians_tuples, 
                                    columns = (['Political_Figures', 'Country']))
df_from_list_of_tuple

             Political_Figures       Country
0        Mustafa Kemal Ataturk        Turkey
1        Franklin D. Roosevelt           USA
2            Winston Churchill            UK
3            Charles de Gaulle        France
4             Jawaharlal Nehru         India
5  Nelson MandelaDeng Xiaoping  South Africa

In [18]:
#Getting a DataFrame from a pandas series 

politicians_dict = {'Politician Name' : pd.Series(politicians_tuples),
                   'Country' : pd.Series(countries)}

politicians_dict

#Once the dictionari is created then it need to be parced to a datafram 

politicians_df = pd.DataFrame(politicians_dict)
politicians_df

{'Politician Name': 0                (Mustafa Kemal Ataturk, Turkey)
 1                   (Franklin D. Roosevelt, USA)
 2                        (Winston Churchill, UK)
 3                    (Charles de Gaulle, France)
 4                      (Jawaharlal Nehru, India)
 5    (Nelson MandelaDeng Xiaoping, South Africa)
 dtype: object, 'Country': 0          Turkey
 1             USA
 2              UK
 3          France
 4           India
 5    South Africa
 6           China
 dtype: object}

                               Politician Name       Country
0              (Mustafa Kemal Ataturk, Turkey)        Turkey
1                 (Franklin D. Roosevelt, USA)           USA
2                      (Winston Churchill, UK)            UK
3                  (Charles de Gaulle, France)        France
4                    (Jawaharlal Nehru, India)         India
5  (Nelson MandelaDeng Xiaoping, South Africa)  South Africa
6                                          NaN         China

# Export to Data CSV from dataFrame

In [19]:
politicians_df.to_csv('DataSets/Politicians.csv',
                     index = False)

# Import a DF from a CSV file

In [20]:
politicians_df_from_file = pd.read_csv('DataSets/Politicians.csv')
politicians_df_from_file

                                   Politician Name       Country
0              ('Mustafa Kemal Ataturk', 'Turkey')        Turkey
1                 ('Franklin D. Roosevelt', 'USA')           USA
2                      ('Winston Churchill', 'UK')            UK
3                  ('Charles de Gaulle', 'France')        France
4                    ('Jawaharlal Nehru', 'India')         India
5  ('Nelson MandelaDeng Xiaoping', 'South Africa')  South Africa
6                                              NaN         China

In [22]:

#importing another Dataset

avocado_data = pd.read_csv('./DataSets/avocado.csv')
avocado_data.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany